=begin 
Класс Station (Станция):
+ Имеет название, которое указывается при ее создании
+ Может принимать поезда (по одному за раз)
Может возвращать список всех поездов на станции, находящиеся в текущий момент
Может возвращать список поездов на станции по типу (см. ниже): кол-во грузовых, 
пассажирских
+ Может отправлять поезда (по одному за раз, при этом, поезд удаляется из списка 
поездов, находящихся на станции).
=end

class Station
  def initialize(name)
    @name = name
    @current_trains = []
  end

  def add_train(@train)
    @current_trains << @train
  end
    
  ###### add your code here

  def push_train(@train)
    @current_trains.delete(@train)
  end
end


=begin 
Класс Route (Маршрут):
+ Имеет начальную и конечную станцию, а также список промежуточных станций. 
+ Начальная и конечная станции указываютсся при создании маршрута, 
  а промежуточные могут добавляться между ними.
+ Может добавлять промежуточную станцию в список
+ Может удалять промежуточную станцию из списка
+ Может выводить список всех станций по-порядку от начальной до конечной
=end

class Route
  def initialize(first_station, last_station)
    @first_station = first_station
    @last_station = last_station
  end
  @route_list = [@first_station, @last_station]

  def add_station(station)
    @route_list.delete_at(-1)
    @route_list.push(station)
    @route_list.push(@last_station)
  end

  def remove_station(station)
    @route_list.delete_at(-2) if @route_list.include?(station)
  end

  def print_route
    puts "The current route consists of stations: #{@route_list}"
  end

end


=begin 
Класс Train (Поезд):
Имеет номер (произвольная строка) и тип (грузовой, пассажирский) и количество 
вагонов, эти данные указываются при создании экземпляра класса
Может набирать скорость
Может возвращать текущую скорость
Может тормозить (сбрасывать скорость до нуля)
Может возвращать количество вагонов
Может прицеплять/отцеплять вагоны (по одному вагону за операцию, 
  метод просто увеличивает или уменьшает количество вагонов). 
  Прицепка/отцепка вагонов может осуществляться только если поезд не движется.
Может принимать маршрут следования (объект класса Route). 
При назначении маршрута поезду, поезд автоматически помещается на первую станцию
 в маршруте.
Может перемещаться между станциями, указанными в маршруте. Перемещение возможно
 вперед и назад, но только на 1 станцию за раз.
Возвращать предыдущую станцию, текущую, следующую, на основе маршрута
=end



# @@trains = [] -- храниит список поездов
# добавить @train